cc -g p3original.c
îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
---Type <return> to continue, or q <return> to quit---c
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7fc: file p3original.c, line 18.
(gdb) r
Starting program: /home/runner/pps-test1-poojas2003-48/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p3original.c:18
18  {
(gdb) n
20    input(&a,&b);            //pass by reference
(gdb) s
input (a=0x7ffe3971197c, b=0x7ffe39711980) at p3original.c:6
6   printf("enter two number\n");
(gdb) n
enter two number
7   scanf("%d%d",a,b);
(gdb) n
5
9
8   }
(gdb) n
main () at p3original.c:21
21    add(a,b,&sum);           //pass by value(a,b) and reference(sum)
(gdb) s
add (a=5, b=9, sum=0x7ffe39711984) at p3original.c:11
11    *sum=a+b;
(gdb) p a
$1 = 5
(gdb) p b
$2 = 9
(gdb) n
12  }
(gdb) n
main () at p3original.c:22
22    output(a,b,sum);         //pass by value
(gdb) s
output (a=5, b=9, sum=14) at p3original.c:15
15    printf("%d+%d=%d\n",a,b,sum);
(gdb) p sum
$3 = 14
(gdb) n
5+9=14
16  }
(gdb) n
main () at p3original.c:23
23    return 0;
(gdb) n
24  }(gdb) c
Continuing.
[Inferior 1 (process 247) exited normally]
(gdb) 